Revit 2027 API
Concrete.ConcreteBmMap Property
 The property labeled "Image" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConcreteBmMap { get; }
Public Shared ReadOnly Property ConcreteBmMap As String
	Get
public:
static property String^ ConcreteBmMap {
	String^ get ();
}
static member ConcreteBmMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace